OpenNuvoton/M251BSP/Library/StdDriver/src/bpwm.c
/**************************************************************************//**
 * @file     bpwm.c
 * @version  V0.10
 * @brief    M251 series BPWM driver source file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2019 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include "NuMicro.h"

/** @addtogroup Standard_Driver Standard Driver
  @{
*/

/** @addtogroup BPWM_Driver BPWM Driver
  @{
*/


/** @addtogroup BPWM_EXPORTED_FUNCTIONS BPWM Exported Functions
  @{
*/

/**
 * @brief Configure BPWM capture and get the nearest unit time.
 * @param[in] bpwm The pointer of the specified BPWM module
 *                - BPWM0 : BPWM Group 0
 *                - BPWM1 : BPWM Group 1
 * @param[in] u32ChannelNum BPWM channel number. Valid values are between 0~5
 * @param[in] u32UnitTimeNsec The unit time of counter
 * @param[in] u32CaptureEdge The condition to latch the counter. This parameter is not used
 * @return The nearest unit time in nano second.
 * @details This function is used to Configure BPWM capture and get the nearest unit time.
 */
uint32_t BPWM_ConfigCaptureChannel(BPWM_T *bpwm, uint32_t u32ChannelNum, uint32_t u32UnitTimeNsec, uint32_t u32CaptureEdge)
{
    (void) u32ChannelNum;
    (void) u32CaptureEdge;
    uint32_t u32Src;
    uint32_t u32BPWMClockSrc;
    uint32_t u32NearestUnitTimeNsec = 0UL;
    uint16_t u16Prescale = 1UL, u16CNR = 0xFFFFUL;
    uint8_t u8BreakLoop = 0UL;

    // M254/6/8 clock source is not supported PLL
    if ((SYS->PDID & 0xff00) == 0x5800 || (SYS->PDID & 0xff00) == 0x5600 || (SYS->PDID & 0xff00) == 0x5400)
    {
        if (bpwm == BPWM0)
        {
            u32Src = CLK_CLKSEL2_BPWM0SEL_PCLK0;
        }
        else     /* (bpwm == BPWM1) for M258G */
        {
            u32Src = CLK_CLKSEL2_BPWM1SEL_PCLK1;
        }
    }
    else
    {
        if (bpwm == BPWM0)
        {
            u32Src = CLK->CLKSEL2 & CLK_CLKSEL2_BPWM0SEL_Msk;
        }
        else     /* (bpwm == BPWM1) */
        {
            u32Src = CLK->CLKSEL2 & CLK_CLKSEL2_BPWM1SEL_Msk;
        }
    }

    if (u32Src == 0UL)
    {
        //clock source is from PLL clock
        u32BPWMClockSrc = CLK_GetPLLClockFreq();
    }
    else
    {
        //clock source is from PCLK
        SystemCoreClockUpdate();

        if (bpwm == BPWM0)
        {
            u32BPWMClockSrc = CLK_GetPCLK0Freq();
        }
        else    /* (bpwm == BPWM1) */
        {
            u32BPWMClockSrc = CLK_GetPCLK1Freq();
        }
    }

    u32BPWMClockSrc /= 1000UL;

    for (u16Prescale = 1UL; u16Prescale <= 0x1000UL; u16Prescale++)
    {
        u32NearestUnitTimeNsec = (1000000UL * u16Prescale) / u32BPWMClockSrc;

        if (u32NearestUnitTimeNsec < u32UnitTimeNsec)
        {
            if (u16Prescale == 0x1000UL)
            {
                /* limit to the maximum unit time(nano second) */
                u8BreakLoop = 1UL;
            }

            if (!((1000000UL * (u16Prescale + 1UL) > (u32NearestUnitTimeNsec * u32BPWMClockSrc))))
            {
                u8BreakLoop = 1UL;
            }
        }
        else
        {
            u8BreakLoop = 1UL;
        }

        if (u8BreakLoop)
        {
            break;
        }
    }

    // convert to real register value
    u16Prescale = u16Prescale - 1UL;
    // all channels share a prescaler
    BPWM_SET_PRESCALER(bpwm, u32ChannelNum, (uint32_t)u16Prescale);

    // set BPWM to down count type(edge aligned)
    (bpwm)->CTL1 = BPWM_DOWN_COUNTER;

    BPWM_SET_CNR(bpwm, u32ChannelNum, u16CNR);

    return (u32NearestUnitTimeNsec);
}

/**
 * @brief This function Configure BPWM generator and get the nearest frequency in up count type auto-reload mode
 * @param[in] bpwm The pointer of the specified BPWM module
 *                - BPWM0 : BPWM Group 0
 *                - BPWM1 : BPWM Group 1
 * @param[in] u32ChannelNum BPWM channel number. Valid values are between 0~5
 * @param[in] u32Frequency Target generator frequency
 * @param[in] u32DutyCycle Target generator duty cycle percentage. Valid range are between 0 ~ 100. 10 means 10%, 20 means 20%...
 * @return Nearest frequency clock
 * @note Since all channels shares a prescaler. Call this API to configure BPWM frequency may affect
 *       existing frequency of other channel.
 */
uint32_t BPWM_ConfigOutputChannel(BPWM_T *bpwm, uint32_t u32ChannelNum, uint32_t u32Frequency, uint32_t u32DutyCycle)
{
    uint32_t u32Src, u32BPWMClockSrc;
    uint32_t u32NearestFrequency, u32NearestCNR, u32CNR = 0x10000UL;
    uint32_t u32Prescale = 1UL;

    if (u32Frequency == 0)
        return u32Frequency;

    // M254/6/8 clock source is not supported PLL
    if ((SYS->PDID & 0xff00) == 0x5800 || (SYS->PDID & 0xff00) == 0x5600 || (SYS->PDID & 0xff00) == 0x5400)
    {
        if (bpwm == BPWM0)
        {
            u32Src = CLK_CLKSEL2_BPWM0SEL_PCLK0;
        }
        else     /* (bpwm == BPWM1) for M258G */
        {
            u32Src = CLK_CLKSEL2_BPWM1SEL_PCLK1;
        }
    }
    else
    {
        if (bpwm == BPWM0)
        {
            u32Src = CLK->CLKSEL2 & CLK_CLKSEL2_BPWM0SEL_Msk;
        }
        else     /* (bpwm == BPWM1) */
        {
            u32Src = CLK->CLKSEL2 & CLK_CLKSEL2_BPWM1SEL_Msk;
        }
    }

    if (u32Src == 0UL)
    {
        //clock source is from PLL clock
        u32BPWMClockSrc = CLK_GetPLLClockFreq();
    }
    else
    {
        //clock source is from PCLK
        SystemCoreClockUpdate();

        if (bpwm == BPWM0)
        {
            u32BPWMClockSrc = CLK_GetPCLK0Freq();
        }
        else     /* (bpwm == BPWM1) */
        {
            u32BPWMClockSrc = CLK_GetPCLK1Freq();
        }
    }

    if (u32Frequency > u32BPWMClockSrc)
        return 0;

    for (u32Prescale = 1UL; u32Prescale <= 0x1000UL; u32Prescale++)   //CLKPSC could be 0~0xFFF
    {
        u32NearestCNR = (u32BPWMClockSrc / u32Frequency) / u32Prescale;

        // If target value is larger than CNR, need to use a larger prescaler
        if (u32NearestCNR <= (0x10000UL))
        {
            u32CNR = u32NearestCNR;
            break;
        }
    }

